#!/usr/bin/python
# -*- coding: UTF-8 -*-
print("奇变偶不变，符号看象限")
print("----------------------------------------------")
constant = "1"
print("constant=" + constant)
print("----------------------------------------------")
# 多个变量赋值
a = b = c = 1
print(a)
print(b)
print(c)
print("----------------------------------------------")
# 指定多个变量
a, b, c = 1, 2, "john"
print(a)
print(b)
print(c)
print("----------------------------------------------")

# 使用del语句删除一些对象的引用。
# del语句的语法是：
var1 = 1
var2 = 10
del var1, var2
print("----------------------------------------------")

# 注释：多行注释用三个单引号 ''' 或者三个双引号 """ 将注释括起来，例如
'''
这是多行注释，用三个单引号
这是多行注释，用三个单引号 
这是多行注释，用三个单引号
'''

"""
这是多行注释，用三个双引号
这是多行注释，用三个双引号 
这是多行注释，用三个双引号
"""

print("我叫 %s 今年 %d 岁!" % ('小明', 10))

list1 = ['Google', 'Runoob', 1997, 2000];
list2 = [1, 2, 3, 4, 5, 6, 7];

print("list1[0]: ", list1[0])
print("list2[1:5]: ", list2[1:5])
